#include<stdio.h>


//移位操作符
//int main()
//{
//	int a = -1;
//
//	//  >>：右移操作符，移动的是二进制位，
//	int b=a >> 1;
//
//	//1.算术右移：右边丢弃，左边补原符号位，正数符号位是0，负数是1，符号位即最高位  √
//	//2.逻辑右移：右边丢弃，左边补0
//
//	printf("%d", b);
//}


//int main()
//{
//	//整数的二进制表示有：原码、反码、补码。    正数的三种码相同，
//	//存储到内存的是补码,也就是说移动的是补码
//	int a = -1;
//	//10000000000000000000000000000001:原码
//	//11111111111111111111111111111110:反码，符号位不变，其他位按位取反
//	//11111111111111111111111111111111：补码=反码+1
//	//
//	int b = a >> 2;
//	printf("%d\n", b);
//}

//int main()
//{
//	int a = -5;
//	//左移操作符，左边丢弃，右边补0
//	int b = a << 1;
//	printf("%d ", b);
//}

//注意：对于移位运算符，不要移动负数位，这个是标准未定义的，例如：int num=10；num>>-1,error

//int main()
//{
//	//&  按位与，二进制位
//	//int a = 3;       //011
//	//int b = 5;		// 101	
//	//int c = a & b;   //001   
//	//printf("%d ", c);
//
//	// |按位或
//	//int a = 3;
//	//int b = 5;
//	//int c = a | b;
//	//printf("%d ", c);
//
//	// ^ 按位异或    对应的二进制位，相同为0，相异为1
//	int a = 3;   
//	int b = 5;
//	int c = a ^ b; 
//	printf("%d ", c);
//}


//不创建临时变量，实现两个数的交换

//int main()
//{
//	int a = 3;
//	int b = 5;
//
//	//加减法-可能会溢出
//	//a = a + b;
//	//b = a - b;
//	//a = a - b;
//
//	//异或的方法
//	a = a ^ b;
//	b = a ^ b;
//	a = a ^ b;
//
//
//	printf("%d,%d ", a, b);
//}

//求一个整数存储在内存中二进制中1的个数
//int main()
//
//{
//	int num = 1;
//	int i = 0;
//	int count = 0;
//
//		scanf_s("%d", &num);
//
//		//num&1==1 
//		for (i = 0; i < 32; i++)
//		{
//			if (((num >> i) & 1) == 1)
//				count++;
//		}
//		printf("二进制中1的个数：%d\n", count);
//
//
//	////统计num的补码中有几个1, 该算法有缺陷
//	//while (num)
//	//{
//	//	if (num % 2 == 1)
//	//	{
//	//		count++;
//	//		num = num / 2;
//	//	}
//	//}
//}


//int main()
//{
//	int a = 10;
//
//	a = a + 2;
//	a += 2;  //复合赋值符
//
//	a = a >> 1;
//	a >>= 1;
//
//	a = a & 1;
//	a &= 1;
//}


//int main()
//{
//	int a = 10;
//	int* p = &a; //取地址操作符
//	*p=20;			// 解引用操作符 
//}

int main()
{
	int a = 10;
	char c = 'r';
	char* p = &c;
	int arr[10] = { 0 };

	//sizeof计算变量所占内存空间的大小，单位是字节
	printf("%d\n", sizeof(a)); //4
	printf("%d\n", sizeof(int)); //4

	printf("%d\n", sizeof(c));//1
	printf("%d\n", sizeof(char));//1

	printf("%d\n", sizeof(p));//4
	printf("%d\n", sizeof(char*));//4

	printf("%d\n", sizeof(arr));//40
	printf("%d\n", sizeof(int [10]));//数组类型，去掉名字，剩下的就是数组的类型



}